{
  "title": "Feature selection strategies: a comparative analysis of SHAP‑value and importance‑based methods",
  "authors": [
    "Huanjing Wang",
    "Qianxin Liang",
    "John T. Hancock",
    "Taghi M. Khoshgoftaar"
  ],
  "abstract": "In the context of high-dimensional credit card fraud data, researchers and practitioners commonly utilize feature selection techniques to enhance the performance of fraud detection models. This study presents a comparison in model performance using the most important features selected by SHAP (SHapley Additive exPlanations) values and the model’s built-in feature importance list. Both methods rank features and choose the most significant ones for model assessment. To evaluate the effectiveness of these feature selection techniques, classification models are built using five classifiers: XGBoost, Decision Tree, CatBoost, Extremely Randomized Trees, and Random Forest. The Area under the Precision-Recall Curve (AUPRC) serves as the evaluation metric. All experiments are executed on the Kaggle Credit Card Fraud Detection Dataset. The experimental outcomes and statistical tests indicate that feature selection methods based on importance values outperform those based on SHAP values across classifiers and various feature subset sizes. For models trained on larger datasets, it is recommended to use the model’s built-in feature importance list as the primary feature selection method over SHAP. This suggestion is based on the rationale that computing SHAP feature importance is a distinct activity, while models naturally provide built-in feature importance as part of the training process, requiring no additional effort. Consequently, opting for the model’s built-in feature importance list can offer a more efficient and practical approach for larger datasets and more intricate models.",
  "keywords": [
    "Feature selection",
    "Class imbalance",
    "Credit card fraud",
    "SHAP",
    "Feature importance"
  ],
  "publication_date": "2024-03-14",
  "doi": "10.1186/s40537-024-00905-w",
  "supplementary_information": null
}